This is happening with `kendra_data_source` as well. 

Steps to reproduce:

1. Create a Kendra index and Kendra datasource ( custom)
2. Comment the datasource and re-apply. 
3. Apply is forcing a replacement of the index which shouldn't be part of this operation.

```
Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # awscc_iam_role.example will be updated in-place
  ~ resource "awscc_iam_role" "example" {
        id                          = "kendra_index_role"
      + managed_policy_arns         = (known after apply)
      + permissions_boundary        = (known after apply)
        tags                        = [
            {
                key   = "Modified By"
                value = "AWSCC"
            },
            {
                key   = "Name"
                value = "Kendra index role"
            },
        ]
        # (8 unchanged attributes hidden)
    }

  # awscc_kendra_data_source.example will be destroyed
  # (because awscc_kendra_data_source.example is not in configuration)
  - resource "awscc_kendra_data_source" "example" {
      - arn            = "arn:aws:kendra:us-east-1:###########:index/b579a25c-02e7-4736-8d4e-726df3f7e7fd/data-source/80e39610-fd7a-4f37-9f68-46844be772ea" -> null
      - data_source_id = "80e39610-fd7a-4f37-9f68-46844be772ea" -> null
      - description    = "example" -> null
      - id             = "80e39610-fd7a-4f37-9f68-46844be772ea|b579a25c-02e7-4736-8d4e-726df3f7e7fd" -> null
      - index_id       = "b579a25c-02e7-4736-8d4e-726df3f7e7fd" -> null
      - language_code  = "en" -> null
      - name           = "example" -> null
      - tags           = [
          - {
              - key   = "Modified By" -> null
              - value = "AWSCC" -> null
            },
        ] -> null
      - type           = "CUSTOM" -> null
    }

  # awscc_kendra_index.example must be replaced
-/+ resource "awscc_kendra_index" "example" {
      ~ arn                                  = "arn:aws:kendra:us-east-1:###########:index/b579a25c-02e7-4736-8d4e-726df3f7e7fd" -> (known after apply)
      + capacity_units                       = (known after apply)
      ~ document_metadata_configurations     = [
          - {
              - name      = "_authors" -> null
              - relevance = {
                  - importance = 1 -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = false -> null
                } -> null
              - type      = "STRING_LIST_VALUE" -> null
            },
          - {
              - name      = "_category" -> null
              - relevance = {
                  - importance = 1 -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "STRING_VALUE" -> null
            },
          - {
              - name      = "_created_at" -> null
              - relevance = {
                  - duration   = "25920000s" -> null
                  - freshness  = false -> null
                  - importance = 1 -> null
                  - rank_order = "ASCENDING" -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "DATE_VALUE" -> null
            },
          - {
              - name      = "_data_source_id" -> null
              - relevance = {
                  - importance = 1 -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "STRING_VALUE" -> null
            },
          - {
              - name      = "_document_title" -> null
              - relevance = {
                  - importance = 2 -> null
                } -> null
              - search    = {
                  - displayable = true -> null
                  - facetable   = false -> null
                  - searchable  = true -> null
                  - sortable    = true -> null
                } -> null
              - type      = "STRING_VALUE" -> null
            },
          - {
              - name      = "_excerpt_page_number" -> null
              - relevance = {
                  - importance = 1 -> null
                  - rank_order = "ASCENDING" -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = false -> null
                } -> null
              - type      = "LONG_VALUE" -> null
            },
          - {
              - name      = "_faq_id" -> null
              - relevance = {
                  - importance = 1 -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "STRING_VALUE" -> null
            },
          - {
              - name      = "_file_type" -> null
              - relevance = {
                  - importance = 1 -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "STRING_VALUE" -> null
            },
          - {
              - name      = "_language_code" -> null
              - relevance = {
                  - importance = 1 -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "STRING_VALUE" -> null
            },
          - {
              - name      = "_last_updated_at" -> null
              - relevance = {
                  - duration   = "25920000s" -> null
                  - freshness  = false -> null
                  - importance = 1 -> null
                  - rank_order = "ASCENDING" -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "DATE_VALUE" -> null
            },
          - {
              - name      = "_source_uri" -> null
              - relevance = {
                  - importance = 1 -> null
                } -> null
              - search    = {
                  - displayable = true -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = false -> null
                } -> null
              - type      = "STRING_VALUE" -> null
            },
          - {
              - name      = "_tenant_id" -> null
              - relevance = {
                  - importance = 1 -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "STRING_VALUE" -> null
            },
          - {
              - name      = "_version" -> null
              - relevance = {
                  - importance = 1 -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "STRING_VALUE" -> null
            },
          - {
              - name      = "_view_count" -> null
              - relevance = {
                  - importance = 1 -> null
                  - rank_order = "ASCENDING" -> null
                } -> null
              - search    = {
                  - displayable = false -> null
                  - facetable   = false -> null
                  - searchable  = false -> null
                  - sortable    = true -> null
                } -> null
              - type      = "LONG_VALUE" -> null
            },
        ] -> (known after apply)
      ~ id                                   = "b579a25c-02e7-4736-8d4e-726df3f7e7fd" -> (known after apply)
      ~ index_id                             = "b579a25c-02e7-4736-8d4e-726df3f7e7fd" -> (known after apply)
        name                                 = "example-index"
      + server_side_encryption_configuration = (known after apply) # forces replacement
        tags                                 = [
            {
                key   = "Modified By"
                value = "AWSCC"
            },
        ]
      ~ user_context_policy                  = "ATTRIBUTE_FILTER" -> (known after apply)
      + user_token_configurations            = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 2 to destroy.
```
